[
  {
    "date":"2024-02-06T11:52:00+00:00",
    "title":"Apple, Snap, Palantir Show the Divide Between the AI Haves and Have-Nots, and 5 Other Things to Know Before the Market Opens",
    "content":"Fed speakers want more inflation data, beaten-down China stocks surge on stimulus hopes, and other news to know today.\n\nContinue reading",
    "link":"https:\/\/finance.yahoo.com\/m\/b18fe277-0c9e-3fcb-8c56-e676c2708e6a\/apple%2C-snap%2C-palantir-show.html",
    "symbols":[
      "0R2V.IL",
      "1SI.STU",
      "AAPL.BA",
      "AAPL.MX",
      "AAPL.NEO",
      "AAPL.SN",
      "AAPL.US",
      "AAPL34.SA",
      "APC.BE",
      "APC.DU",
      "APC.F",
      "APC.HA",
      "APC.HM",
      "APC.MU",
      "APC.STU",
      "APC.XETRA",
      "APC8.F",
      "P2LT34.SA",
      "PLTR.US",
      "PTX.F"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":0.477,
      "neg":0,
      "neu":0.823,
      "pos":0.177
    }
  },
  {
    "date":"2024-02-06T11:17:28+00:00",
    "title":"Spotify shares jump after strong guidance and user growth outweigh earnings miss",
    "content":"Spotify Technology (SPOT) reported fiscal fourth quarter earnings on Tuesday that missed expectations. But strong guidance helped boost shares in early trading as the music-streaming platform continues to focus on profitability amid recent price hikes and changes to its podcasting strategy.\n\nThe company reported an operating loss of 75 million euros ($80.6 milliom) in the quarter amid severance and real estate related charges, but guided to strong Q1 operating income of 180 million euros.\n\nSpotify's stock jumped in premarket trading immediately following the results, up nearly 10%.\n\nThe streaming service reported a net loss of 70 million euros ($75.2 million), or a loss of 0.36 euros per share. That missed analyst expectations of a loss of 0.31 euros per share. It also compares with the year-earlier period loss of 430 million euros, or a loss of 2.23 euros a share.\n\nThe losses come after the company turned a profit in Q3 for the first time in over a year.\n\nGross margins, however, came in stronger than expected at 26.7%, slightly beating company guidance of 26.6%. The streamer said it expects margins to tick down slightly to 26.4% in the first quarter, primarily driven by year-over-year improvements in music and podcasting.\n\nSpotify has previously said it expects the metric to come in between 30% and 35% over the long term amid plans to further scale its podcasting and ads business. With the exception of Q3, margins have been stuck between 21% and 25% in recent quarters.\n\nRevenue, meanwhile, totaled 3.67 billion euros — 16% higher compared with the fourth quarter of 2022, but slightly below Wall Street expectations of 3.72 billion euros. Spotify guided to first quarter revenue of 3.6 billion euros.\n\nUser figures\n\nTotal monthly active users (MAUs) beat company estimates of 601 million to hit 602 million in the quarter — a 23% improvement compared with the total in the year-ago period. The streaming service anticipates Q1 MAUs to come in at 618 million.\n\nStory continues\n\nPremium subscribers also surpassed Wall Street expectations of 224 million — a 15% year-over-year jump. Spotify expects that subscriber count to increase to 239 million in the first quarter. Spotify's strong guidance helped boost shares in early trading. (Patrick Semansky\/AP Photo) (ASSOCIATED PRESS)\n\nFree cash flow, another key metric for investors, jumped on both a yearly and quarterly basis, coming in at 396 million euros compared to 216 million euros in the prior quarter and negative 73 million euros in the year-ago period.\n\nAverage revenue per user, or ARPU, for Premium subscriptions increased 1% to 4.60 euros (or 5% year-over-year, excluding foreign exchange headwinds.) ARPU was driven by price increase benefits that was partially offset by discounted plans and lower prices in emerging markets, the company said.\n\nProfit pledge\n\nOverall, analysts have been bullish on Spotify after the audio giant pledged to improve its profitability beginning in 2023 on a gross margin and operating income basis.\n\nSpotify spent $1 billion pushing into the podcast market over the past four years with splashy A-list deals and $400 million-plus studio acquisitions.\n\nThat spending took a significant bite out of gross margins and weighed heavily on profitability. In response, Spotify committed to several rounds of layoffs — three in 2023 alone. The company also announced CFO Paul Vogel will step down from his position on March 31.\n\nIn addition to layoffs, Spotify raised prices, changed up its royalty structure, and made audiobooks free to paying subscribers.\n\nBut more changes are expected as Spotify further revamps its podcast strategy to focus more on distribution rather than exclusivity.\n\nLate last week, Spotify announced a new deal with its most popular podcaster: Joe Rogan.\n\nThe company revealed Rogan's podcast, which was previously exclusive to Spotify, will be available on additional services like Apple Podcasts (AAPL), Amazon Music (AMZN), and YouTube (GOOGL) for the first time in years.\n\nThe multiyear deal, which the Wall Street Journal pegged at $250 million, represents Spotify's broader podcast distribution push, which it first began to roll out last year.\n\nUnder the new agreement, Spotify will handle distribution and ad sales as it works to maximize revenue. Rogan, meanwhile, will receive a guaranteed minimum rate and cut of the advertising revenue.\n\nThe company recently renegotiated a similar contract with Alexandra Cooper of \"Call Her Daddy\".\n\nThe podcast, which Spotify purchased for a reported $60 million in 2021, will now be available on all major audio platforms after more than two years as a Spotify exclusive. The company will maintain the exclusive rights to the podcast's video portion.\n\nSpotify shares have surged about 80% over the past year and are up more than 15% year to date. The stock is still off about 40% from its record high of $364.59 a share in February 2021.\n\nAlexandra Canal is a Senior Reporter at Yahoo Finance. Follow her on Twitter @allie_canal, LinkedIn, and email her at alexandra.canal@yahoofinance.com.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance",
    "link":"https:\/\/finance.yahoo.com\/news\/spotify-shares-jump-after-strong-guidance-and-user-growth-outweigh-earnings-miss-111728985.html",
    "symbols":[
      "0R1O.IL",
      "0R2V.IL",
      "0RIH.IL",
      "0RIH.LSE",
      "639.F",
      "639.STU",
      "639.XETRA",
      "AAPL.BA",
      "AAPL.MX",
      "AAPL.NEO",
      "AAPL.SN",
      "AAPL.US",
      "AAPL34.SA",
      "ABE0.F",
      "ABEA.F",
      "ABEA.STU",
      "ABEA.XETRA",
      "ABEC.F",
      "ABEC.STU",
      "ABEC.XETRA"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":0.995,
      "neg":0.062,
      "neu":0.817,
      "pos":0.122
    }
  },
  {
    "date":"2024-02-06T09:40:00+00:00",
    "title":"Best Stock to Buy Right Now: Apple vs. Amazon",
    "content":"Earnings season has arrived, providing fresh batches of figures to consider when expanding your portfolio.\n\nTwo of the major companies releasing results last week were Apple(NASDAQ: AAPL) and Amazon(NASDAQ: AMZN). Both have built immense brand loyalty with consumers and boast powerful positions in retail. Apple has almost unrivaled supremacy in consumer tech products. Amazon has similar dominance in e-commerce and the cloud market.\n\nSince 2019, Apple has soared by 349% and Amazon by 96%. While past growth is no guarantee of what's to come, these companies have solid long-term outlooks as they continue to expand in their respective industries. Meanwhile, Apple and Amazon both beat Wall Street forecasts for earnings per share  and revenue in their most recent quarters.\n\nBut is Apple or Amazon the better stock to buy right now?\n\nApple\n\nApple is coming out of a tricky year. Macroeconomic headwinds caught up with the company in its fiscal 2023 (which ended Sept. 30, 2023), and revenue dipped by 3%. However, the results from its fiscal 2024 first quarter (which ended Dec. 31, 2023) showed signs that a recovery could be underway.\n\nDuring the quarter, Apple's net sales rose 2% year over year to $120 billion, beating analysts' expectations by more than $1 billion and breaking a streak of four consecutive quarters of revenue declines. Meanwhile, its earnings hit $2.18 per share compared to an expected $2.10 per share.\n\nYet, outperforming estimates wasn't enough to quell investor concern over its iPhone business. Smartphone sales increased 6% in Q1 2024, yet fell 13% in China. That country has increased restrictions on the iPhone, threatening sales in one of Apple's most crucial markets. China accounts for about 17% of its product sales.\n\nAs a result, Apple's stock fell nearly 4% in after-hours trading following its earnings release on Feb. 1.\n\nHowever, recent challenges are why keeping a long-term perspective with proven growth stocks like Apple is crucial. The company has a highly lucrative digital services business and is investing heavily in expanding markets like artificial intelligence (AI).\n\nStory continues\n\nAdditionally, the tech firm hit nearly $100 billion in free cash flow last year. It has the funds to overcome current headwinds and continue investing in its business.\n\nAmazon\n\nWall Street seemed to have the opposite reaction to Amazon's earnings release. The e-commerce giant's shares rose by nearly 10% after it posted its Q4 2023 results on Feb. 1.\n\nDuring the quarter, Amazon's revenue grew 14% year over year to $170 billion, outperforming the consensus forecast by close to $4 billion. Meanwhile, its earnings per share came to $1, compared to an expected $0.80.\n\nMuch of Amazon's stellar growth came from its e-commerce business. Its North American segment posted operating income exceeding $6 billion, significantly improving on the $240 million in losses reported in the year-ago quarter.\n\nAmazon's Q4 was a fitting end to a stellar year of growth. After suffering steep declines in 2022 as spikes in inflation curbed consumer discretionary spending, the company pulled off an impressive turnaround.\n\nAs a result, Amazon's stock is up 63% year over year, compared to a 28% rise in Apple's share price. During the same period, Amazon's free cash flow soared by 427% to $17 billion. Apple's total free cash flow is higher, but declined by just over 1% over the last 12 months.\n\nAmazon is on a promising growth trajectory, with solid retail growth and a highly profitable cloud business.\n\nIs Apple or Amazon the best stock to buy right now?\n\nComparing these firms' forward price-to-earnings ratios (P\/E), Apple's 28 against Amazon's 48 makes the iPhone company's stock look like a far better value. Forward P\/E is a valuation metric calculated by dividing a company's share price by its estimated future earnings per share. The lower the figure, generally, the better the value.\n\nHowever, the chart below shows their valuations are more complex than that. AAPL EPS Estimates for 2 Fiscal Years Ahead Chart\n\nThis chart shows Apple's earnings could hit nearly $8 per share over the next two fiscal years, and Amazon's might reach just under $7 per share. Multiplying these figures by the companies' forward P\/E ratios yields stock prices of $218 for Apple and $317 for Amazon.\n\nBased on their current positions, these projections would see Apple's stock price rise 17% by fiscal 2026, while Amazon shares would increase by 84%.\n\nAs a result, Amazon's stock is a no-brainer in a decision between these two companies. The tech giant is on a growth path too good to ignore, making it the better stock to buy right now.\n\nShould you invest $1,000 in Apple right now?\n\nBefore you buy stock in Apple, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of February 5, 2024\n\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon and Apple. The Motley Fool has a disclosure policy.\n\nBest Stock to Buy Right Now: Apple vs. Amazon was originally published by The Motley Fool",
    "link":"https:\/\/finance.yahoo.com\/news\/best-stock-buy-now-apple-094000240.html",
    "symbols":[
      "AAPL.US",
      "AMZN.US"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":0.999,
      "neg":0.038,
      "neu":0.806,
      "pos":0.156
    }
  },
  {
    "date":"2024-02-05T23:01:14+00:00",
    "title":"20 Best Permanent Residency Countries in the World",
    "content":"In this article, we will take a look at 20 Best Permanent Residency Countries in the World. You can skip our detailed analysis of permanent residency and go directly to the 5 Best Permanent Residency Countries in the World.\n\nThis vast world is filled with places of wonderment. Many of us love to travel and experience the diversity in nature and culture that has spread out to nooks and corners around the globe. Additionally, there are those who choose to settle down permanently in a country other than their birthplace. In the latter case, the idea behind the visit is to simply explore new experiences and spend some vacation time in a pleasing manner. However, in the former, practicality takes precedence, and numerous variables are considered before a final decision is reached. The aim is to choose the best permanent-residency country in the world.\n\nAccording to the IOM UN Migration Report 2022, the majority of people worldwide still reside in their countries of origin. Only one in thirty individuals falls into the immigrant category. In 2020, it was estimated that approximately 281 million international migrants existed globally, constituting about 3.6% of the total world population. Notably, this figure marked an increase of 128 million people compared to the 1990 figure and was three times higher than the estimated figure for 1970. Thus, this indicates a burgeoning desire in people to move, sparking the search for the best country in the world to settle permanently.\n\nWhat is Permanent Residency?\n\nPermanent residency, often referred to as a PR visa, denotes a resident status in a country other than one's country of origin, granting individuals the right to live, work, study, and even establish a business in that country. Holders of a PR visa may also be entitled to social security, healthcare, and various financial benefits. Additionally, the visa may permit individuals to bring their families, including parents, and children may qualify for free schooling. It is important to note that these benefits can vary across countries. The residency permit, which is issued to legally ensure these activities, is usually renewed after a specific time period. During this time, individuals are free to enter or leave the country, but it's crucial to keep in mind that maintaining residency status typically requires a minimum physical presence.\n\nStory continues\n\nTypes of Permanent Residency Visas\n\nThere are various types of permanent residency visas, including skilled immigration, state\/territory\/province-sponsored immigration, employer-based immigration, family migration, and investment migration. While certain general requirements apply to all PR visas, specific details can vary from country to country. In fact, some countries do not even permit permanent residency, and the necessary physical presence requirement also differs across nations. Hence, before uprooting one's life to move elsewhere, it's essential to ensure that the chosen destination is the best fit for permanent residency.\n\nThe Country with the Highest Immigrants\n\nOver the past decade, a significant number of individuals have been seeking settlement or acquiring second citizenship in European nations. This trend has been further fueled by European countries easing their immigration processes, largely in response to labor shortages within the union. However, it's noteworthy to highlight the permanent immigrant inflow figure of the United States for the year 2022, standing at 1.05 million--the highest compared to other countries. The U.S. has consistently ranked as the top country for accepting immigrants, with the 2021 figure reaching 833,900, as reported by US News. This trend is unsurprising, given the country's generous approach to immigration through various channels. One notable method is employer-based immigration, where companies sponsor employees for green cards. Tech giants like Apple Inc. (NASDAQ: AAPL), Microsoft Corporation (NASDAQ: MSFT), and Adobe Inc. (NASDAQ: ADBE), among others, have actively sponsored their employees for green cards.\n\nApple Inc. (NASDAQ: AAPL) is an American multinational technology company that has employed a substantial number of overseas workers over the years. In the fiscal years 2020 to 2022 alone, the company submitted 13,381 labor condition applications for H-1B visas and 3,412 labor certifications for green cards. Notably, Apple Inc. (NASDAQ: AAPL) recently reached a $25 million settlement with the U.S. government concerning the hiring of immigrants.\n\nMicrosoft Corporation (NASDAQ: MSFT), another American multinational technology company, has employed a significant number of foreign workers. From 2020 to 2022, the company submitted 26,695 labor condition applications for H-1B visas and 9,920 labor certifications for green cards. Barbara Leen, Senior Corporate Counselor at Microsoft Corporation (NASDAQ: MSFT), remains an advocate for immigrants, actively urging for reform in the U.S. immigration policy.\n\nLet’s take a look at our list of 20 Best Permanent Residency Countries in the World. 20 Best Permanent Residency Countries in the World\n\n20 Best Permanent Residency Countries in the World\n\nMethodology\n\nTo determine the top 20 countries for permanent residency, our focus centered on the key reasons people move, such as improved work opportunities and a better quality of life, encompassing health and education. Our methodology relied on data from the Migrant Integration Policy Index 2020, considering metrics like security of permanent residency, labor market mobility, education, and health integration for each nation. By averaging these scores, we identified countries facilitating smoother relocation while meeting these key objectives. In the case of tied averages, the cost of living index served as a tie-breaker. For instance, if three places had the same scores, 0.2 points were awarded for the highest cost of living index, and 0.1 points for the second highest. A higher average score indicates a more favorable ranking.\n\nBy the way, Insider Monkey is an investing website that uses a consensus approach to identify the best stock picks of more than 900 hedge funds investing in US stocks. The website tracks the movement of corporate insiders and hedge funds. Our top 10 consensus stock picks of hedge funds outperformed the S&P 500 stock index by more than 140 percentage points over the last 10 years (see the details here). So, if you are looking for the best stock picks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\n20 Best Permanent Residency Countries in the World\n\n20. Japan\n\nPermanent Residency Score: 63\n\nLabor Market Mobility Score: 59\n\nHealth Score: 65\n\nEducation Score: 33\n\nInsider Monkey Average Score: 55\n\nIn the Asian region, Japan stands out as one of the best countries for permanent residency. As a developed nation, it ensures a high quality of life for its residents. Geographically well-positioned, Japan provides strategic access to other Asian countries, as well as Australia, New Zealand, and the South Pacific Islands, offering immigrants diverse opportunities. The country's high permanent residency score, coupled with robust health integration and labor mobility prospects, emphasizes the favorable conditions for immigrants to settle comfortably. Notably, Japan's permanent residency is granted indefinitely, in contrast to the continuous renewals or predetermined time limits associated with other visas.\n\n19. United Kingdom\n\nPermanent Residency Score: 58\n\nLabor Market Mobility Score: 48\n\nHealth Score: 75\n\nEducation Score: 40\n\nInsider Monkey Average Score: 55.25\n\nThe United Kingdom remains one of the most favored destinations for expatriates. As a developed nation with high-quality amenities, particularly in education, many individuals aspire to secure permanent residency in the UK. Those with this status can enjoy various benefits, including the right to live and work in the country indefinitely. However, certain situations, such as spending more than two years outside the country or being convicted of a criminal offense, may nullify this right. The overall scores for the country present a positive picture, with a particularly favorable outlook on the health integration of immigrants-- a key incentive for those willing to go through the process of moving abroad.\n\n18. Czechia\n\nPermanent Residency Score: 50\n\nLabor Market Mobility Score: 54\n\nHealth Score: 61\n\nEducation Score: 60\n\nInsider Monkey Average Score: 56.25\n\nThe Czech Republic stands out as one of the greatest countries in Europe, offering a safe, stable, and culturally diverse life while maintaining a high standard of living. With a lower cost of living compared to some other European nations and a business-friendly environment, it presents a prosperous outlook. Obtaining permanent residency status in the Czech Republic allows individuals to work and conduct business like citizens, with easy access to the labor market. The country's high scores in labor market mobility, health, and education further indicate favorable conditions for immigrant integration, making Czechia one of the best countries for permanent residency worldwide.\n\n17. South Korea\n\nPermanent Residency Score: 60\n\nLabor Market Mobility Score: 65\n\nHealth Score: 40\n\nEducation Score: 72\n\nInsider Monkey Average Score: 59.25\n\nIn recent years, South Korea has not only gained popularity as a tourist destination but has also become a favored choice for expatriates. The country offers a high quality of life with a reasonable cost of living and competitive salaries. Immigrants can find a conducive environment for settlement with a notably high security of permanent residency. The educational prospects for children are promising, and the labor market mobility score supports individuals moving there for job or business purposes. Overall, South Korea is well-positioned to accommodate immigrants, making it one of the best countries for permanent residency in the world.\n\n16. Netherlands\n\nPermanent Residency Score: 52\n\nLabor Market Mobility Score: 65\n\nHealth Score: 65\n\nEducation Score: 57\n\nInsider Monkey Average Score: 59.75\n\nBike enthusiasts may find the prospect of permanently settling down in the Netherlands particularly exciting, but the country boasts many other advantages as well. With a high standard of living offering excellent access to healthcare, education, and a robust labor market, the Netherlands provides a quality lifestyle, even though it may not be as affordable as some other European countries. Notably, the country secured the seventh position in the 2022 InterNation’s Working Abroad Index, with impressive scores in working culture and satisfaction. The permanent residency score further indicates a secure status for immigrants, solidifying the Netherlands as one of the best countries for permanent residency worldwide.\n\n15. Australia\n\nPermanent Residency Score: 46\n\nLabor Market Mobility Score: 37\n\nHealth Score: 79\n\nEducation Score: 79\n\nInsider Monkey Average Score: 60.25\n\nWith a thriving economy, the Australian government actively promotes permanent residency, granting individuals the right to work and access the labor market. While the integration score may be somewhat lower, job opportunities are still available in the market. The allure of a high-quality life in Australia is a significant driver for the increasing interest in permanent residency. This status not only provides the right to work but also includes access to Medicare and free government primary and secondary school education. Integration scores further indicate the ease with which immigrants can enjoy these facilities. Australia unequivocally stands as one of the best countries for permanent residency, offering a high quality of life and essential amenities at a reasonable cost.\n\n14. Estonia\n\nPermanent Residency Score: 75\n\nLabor Market Mobility Score: 69\n\nHealth Score: 29\n\nEducation Score: 69\n\nInsider Monkey Average Score: 60.5\n\nFor those seeking European permanent residency, Estonia emerges as a viable option. Especially attractive to tech individuals and entrepreneurs looking to leverage benefits from start-ups, Estonia is a favorable place to settle. Boasting a business-friendly environment, the country offers numerous tax benefits, making it an asset for foreign investors. The high labor market mobility score indicates a strong likelihood of immigrant integration into society. Estonia's permanent residency procedures are also conducive to securely settling immigrants in the country. Heading into 2024, it remains one of the cheapest countries to obtain permanent residency.\n\n13. Austria\n\nPermanent Residency Score: 50\n\nLabor Market Mobility Score: 59\n\nHealth Score: 81\n\nEducation Score: 52\n\nInsider Monkey Average Score: 60.6\n\nWhen you think of Austria, Vienna immediately comes to mind. This renowned city is synonymous with an excellent quality of life, offering exquisite food and wine. Affordable and high-quality healthcare and education further contribute to the appeal. Austria has earned a reputation for maintaining an exceptional work-life balance and has successfully accommodated over 1 million expats from around the world. The scores indicate that immigrants are likely to encounter few hurdles when putting down roots in this European country. Hence, Austria rightfully earns its place on our list of the best countries for permanent residency worldwide.\n\n12. Switzerland\n\nPermanent Residency Score: 48\n\nLabor Market Mobility Score: 63\n\nHealth Score: 83\n\nEducation Score: 48\n\nInsider Monkey Average Score: 60.7\n\nSwitzerland, among European countries, stands out for its exceptionally high quality of life for residents. Beyond the breathtaking scenery, individuals can capitalize on abundant work opportunities and access top-notch health and education facilities. The labor market mobility score reflects the ease with which immigrants can integrate into the job market. With competitive salaries and high satisfaction among immigrants, Switzerland truly excels in offering a superior quality of life.\n\n11. Germany\n\nPermanent Residency Score: 54\n\nLabor Market Mobility Score: 81\n\nHealth Score: 63\n\nEducation Score: 55\n\nInsider Monkey Average Score: 63.25\n\nGerman permanent residency ranks among the favorites for expats worldwide, and rightfully so, as Germany stands among the strongest economies in Europe. Residents enjoy a very high quality of life at an affordable range. The country's excellent education and health facilities serve as major attractions for those looking to settle. The permanent residency score emphasizes a relatively secure route for immigrants. Furthermore, international high-skilled workers can greatly benefit from the job market, which includes access to the European Union work market. The labor market mobility score provides evidence of the easy integration immigrants can achieve in this country.\n\n10. Italy\n\nPermanent Residency Score: 67\n\nLabor Market Mobility Score: 67\n\nHealth Score: 79\n\nEducation Score: 43\n\nInsider Monkey Average Score: 64\n\nAs one of the world's largest economies, Italy ranks among the best countries for permanent residency. The nation offers a high quality of life, particularly in healthcare, and serves as a gateway to the European market. With a comparatively low cost of living and encouraging permanent residency policies, Italy stands as an attractive destination for immigrants.\n\n9. Spain\n\nPermanent Residency Score: 75\n\nLabor Market Mobility Score: 67\n\nHealth Score: 81\n\nEducation Score: 43\n\nInsider Monkey Average Score: 66.5\n\nAs one of Europe's countries with the lowest living costs, coupled with excellent public healthcare and education, it's no surprise that this nation is among the best for permanent residency worldwide. The stable political and economic environment ensures easy integration for immigrants. This is further evidenced by the country's high permanent residency score, providing security for the minds of new settlers.\n\n8. Belgium\n\nPermanent Residency Score: 75\n\nLabor Market Mobility Score: 56\n\nHealth Score: 73\n\nEducation Score: 74\n\nInsider Monkey Average Score: 69.5\n\nBelgium is one of those countries where individuals seeking permanent residency can greatly benefit from policies geared towards ensuring their easy integration into society. The country not only provides access to the large European market but also facilitates easy integration for immigrants. With excellent health and education facilities, new residents can maintain their objective for a high quality of life. Moreover, the cost of living is affordable. Consequently, Belgium holds the 8th place on our list of the best countries for permanent residency worldwide.\n\n7. New Zealand\n\nPermanent Residency Score: 63\n\nLabor Market Mobility Score: 59\n\nHealth Score: 83\n\nEducation Score: 76\n\nInsider Monkey Average Score: 70.25\n\nKnown for its family-friendliness and high-quality education and healthcare, this country offers quick and affordable access to these facilities for those qualifying for permanent residency. Abundant work opportunities and a conducive labor market mobility score make it an attractive option for immigrants. For those seeking permanent residency in a developed nation to enjoy various perks, New Zealand is undoubtedly one of the best countries.\n\n6. United States of America\n\nPermanent Residency Score: 63\n\nLabor Market Mobility Score: 69\n\nHealth Score: 79\n\nEducation Score: 83\n\nInsider Monkey Average Score: 73.5\n\nThe 'land of opportunity' indeed offers an easy and comfortable high standard of life for those seeking permanent settlement. Known for its robust economy, new residents have numerous work options to explore and build upon. The high labor market mobility score indicates ample access for immigrants. The United States is renowned for providing the best international education, including institutions like Harvard, the world’s top university. Permanent foreign residents can benefit from this without incurring the international costs of higher education, ensuring a superlative experience. Thus, the United States is undoubtedly one of the best countries for permanent residency in the world.\n\nClick to continue reading and see our 5 Best Permanent Residency Countries in the World.\n\nSuggested Articles:\n\n20 Best Places to Retire in Italy for US Citizens 15 Countries With The Most Affordable Healthcare for US Retirees 20 Countries With The Best English Accent in The World\n\nDisclosure: None. 20 Best Permanent Residency Countries in the World is originally published on Insider Monkey.",
    "link":"https:\/\/finance.yahoo.com\/news\/20-best-permanent-residency-countries-230114854.html",
    "symbols":[
      "0QYP.IL",
      "0R2V.IL",
      "AAPL.BA",
      "AAPL.MX",
      "AAPL.NEO",
      "AAPL.SN",
      "AAPL.US",
      "AAPL34.SA",
      "ADBE.US",
      "APC.BE",
      "APC.DU",
      "APC.F",
      "APC.HA",
      "APC.HM",
      "APC.MU",
      "APC.STU",
      "APC.XETRA",
      "APC8.F",
      "MSF.BE"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":1,
      "neg":0.01,
      "neu":0.793,
      "pos":0.197
    }
  },
  {
    "date":"2024-02-05T22:48:12+00:00",
    "title":"Forgot Your Apple Vision Pro’s Passcode? You May Have to Take It Back to Store",
    "content":"(Bloomberg) -- Buyers of Apple Inc.’s new Vision Pro headset are finding it can be a major hassle if they lose their passcode.\n\nMost Read from Bloomberg\n\nKing Charles Treated for Cancer in New Health Scare for Monarchy Why NYC Apartment Buildings Are on Sale Now for 50% Off China Tightens Some Trading Restrictions for Domestic and Offshore Investors Eastern Europe’s Richest Woman Pivots $43 Billion Empire West Bonds Fall After ‘One-Two Punch’ of ISM, Fedspeak: Markets Wrap\n\nThe company is telling users who forget their code — typically a series of digits — that they’ll have to bring the device to a store or mail it to AppleCare customer support if they want to get it working again. Apple will then erase and reset it.\n\nThe issue is one of a few early customer-service snags surrounding the $3,499 device, which went on sale Friday. The company’s support staff also has been fielding questions from users struggling to set up Optic ID — an eye-scanning tool for logging into the device — and the built-in Apple Music app.\n\nThe passcode problem could be particularly frustrating. When customers enter their passcode incorrectly too many times, the headset will be disabled. If users still can’t recall their passcode after a waiting period, they’ll need to send it back to Apple to be reset, according to guidance given to the company’s support staff. At that point, all content on the device will be erased.\n\nIt’s a quirk that doesn’t exist with Apple’s other products. The company’s smartwatch, for instance, has a mechanism that lets users set it up again if a passcode is forgotten.\n\nIt’s possible that Apple makes software changes in the near future that would allow the passcode to be reset without needing to send the product back. An Apple spokeswoman didn’t respond to a request for comment.\n\nOn Apple’s community forum, one customer said he spoke to an agent who was flooded with calls about the problem. “He’s had to deal with a lot of angry customers after telling them their only recourse is to return to the store,” the user wrote. “He said Apple Support was really caught off guard by this and apologized for not being better prepared.”\n\nStory continues\n\nOne complication with the Vision Pro is it doesn’t have a USB-C port that lets users plug it into a Mac for troubleshooting. The company did release a special strap for developers to be able to attach the headset to a Mac last week, but that accessory costs about $300 and isn’t meant for consumers.\n\nRead More: Apple Vision Pro Debut Brings New Shopping Experience\n\nThe Vision Pro is Apple’s first major new hardware category since it began selling smartwatches almost a decade ago. The device isn’t expected to be a blockbuster product — partly due to its hefty price tag — but curious customers streamed into Apple stores over the weekend to try it out. The product’s reception has been generally positive, with reviewers praising its immersive video playback and productivity features.\n\nMost Read from Bloomberg Businessweek\n\nA Brutal Crime Crackdown Is Emboldening Leaders Across Latin America Bloomberg New Economy Is Looking for World-Changing Leaders  Elon Musk May Have Lost More Than a $55 Billion Payday Mano dura de El Salvador contra el crimen seduce a América Latina Chinese Students Abroad Struggle With Tuition as Economy Falters\n\n©2024 Bloomberg L.P.",
    "link":"https:\/\/finance.yahoo.com\/news\/forgot-apple-vision-pro-passcode-224812680.html",
    "symbols":[
      "0R2V.IL",
      "AAPL.BA",
      "AAPL.MX",
      "AAPL.NEO",
      "AAPL.SN",
      "AAPL.US",
      "AAPL34.SA",
      "APC.BE",
      "APC.DU",
      "APC.F",
      "APC.HA",
      "APC.HM",
      "APC.MU",
      "APC.STU",
      "APC.XETRA",
      "APC8.F"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":0.587,
      "neg":0.063,
      "neu":0.867,
      "pos":0.071
    }
  },
  {
    "date":"2024-02-05T22:17:35+00:00",
    "title":"Bank of America reaffirms Apple's Buy rating over Vision Pro",
    "content":"Apple's (AAPL) new Vision Pro headset went on sale last week at a starting price of $3,499. Bank of America analysts reiterated their Buy rating on Apple after testing out the AR\/VR headset.\n\nYahoo Finance's Pras Subramanian, Josh Schafer, and Alexandra Canal weigh in on the value of this new wearable product to Apple's earnings across the coming years.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Luke Carberry Mogan.",
    "link":"https:\/\/finance.yahoo.com\/video\/bank-america-reaffirms-apples-buy-221735268.html",
    "symbols":[
      "0R2V.IL",
      "AAPL.BA",
      "AAPL.MX",
      "AAPL.NEO",
      "AAPL.SN",
      "AAPL.US",
      "AAPL34.SA",
      "APC.BE",
      "APC.DU",
      "APC.F",
      "APC.HA",
      "APC.HM",
      "APC.MU",
      "APC.STU",
      "APC.XETRA",
      "APC8.F"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":0.527,
      "neg":0,
      "neu":0.951,
      "pos":0.049
    }
  },
  {
    "date":"2024-02-05T21:38:49+00:00",
    "title":"People are wearing Apple Vision Pro headsets while driving Teslas. Fuzzy distracted-driving laws suggest they can get away with it",
    "content":"Apple Vision Pro owners seem willing to pay thousands of dollars to not look at the world in front of them.\n\nSince Apple Vision Pro’s Friday release across U.S. stores — with an eye-watering starting price of $3,500 — people have been spotted wearing their headsets courtside at NBA games, at the gym, on the subway, and crossing the street. At least two viral videos show people in the driver’s seat of a moving Tesla while still wearing the Apple Vision Pro headset, drawing criticism from government officials and other advocates for distraction-free driving.\n\n“Driving while wearing a VR headset is reckless and disregards the safety of everyone on the road,”  a National Highway Traffic Safety Administration spokesperson told Fortune in a statement. “All vehicles with advanced driver assistance systems require a fully attentive human driver performing the driving task and monitoring the surrounding environment at all times.”\n\nThe Apple Vision Pro user guide warns users to “never use Apple Vision Pro while operating a moving vehicle, bicycle, heavy machinery, or in any other situations requiring attention to safety.”\n\nDistracted driving in the U.S. is a growing problem. The NHTSA reported 3,522 deaths in 2021 — compared to 3,142 the year before, a 12% increase — from distracted driving, or “any activity that diverts attention from driving” like texting, eating, or fiddling with your in-car entertainment. These accidents account for between 8-9% of car-related deaths in the U.S.\n\nCars with self-driving features have dangers of their own. Tesla recalled 2 million vehicles in December due to issues with the self-driving features, and U.S. safety regulators have investigated 1,000 Tesla Autopilot-related accidents, 40 of which were fatal.\n\nWhile there isn’t comprehensive evidence on the prevalence of distracted driving in partially automated vehicles, according to the Insurance Institute for Highway Safety, there’s a widespread perception that partially automated vehicles are the same as fully self-driving cars, which has led drivers to take their eyes off the road and hands off the wheel.\n\nStory continues\n\nDante Lentini, who posted a video of himself wearing the Apple Vision Pro headset while in the driver’s seat of a partially automated Tesla and appearing to be pulled over by police, told Fortune that the stunt wasn’t as dangerous as it looked. He said his device was on transparency mode and that he was viewing the road from the headset’s cameras. Lentini said an Apple engineer told him the Apple Vision Pro has a steering-wheel detector that does not allow users in the driver seat to use its apps. Apple did not respond to Fortune’s request for comment.\n\nWearing the headset while driving isn’t as dangerous as using other technologies behind the wheel, Lentini argued.\n\n“While I understand the initial backlash and concern, I believe people may not know the device displays a passthrough vision display of what’s in front of me,” he said. “While I don’t recommend driving with it on, I would find someone being on their phone or even eating to be more hindered.”\n\nDespite the video showing a police car pulled up behind him in a parking lot, Lentini was not pulled over or given a citation. The video was meant to be a skit, he said.\n\nSwerving into legal troubles\n\nLentini wasn’t busted for distracted driving, and inconsistencies in laws banning distracting technology in cars may explain why.\n\nThe use of handheld devices while driving is illegal in 24 states, and texting is illegal in 48 states, according to the Bureau of Transportation Statistics — and in all but two of those states, texting while driving is a primary law. That means law enforcement can ticket a driver for distracted driving without any other traffic violation, such as speeding.\n\nBut texting only accounts for some of the distractions behind the wheel. Two-thirds of drivers surveyed by the IIHS reported performing a distracting activity behind the wheel, like using a navigation app, making a call, or reading texts. Eight percent of those surveyed reported playing a video game while driving.\n\nWhile 35 states have laws that prohibit screens in drivers’ lines of sight, some of those states, such as New York and New Jersey, limit the ban to television, not internet streaming. In states like Texas, similar bans don’t apply to devices with screens mounted near the dashboard.\n\nThe introduction of face-mounted technology further complicates how distracted-driving laws are enforced. In 2013, Southern California driver Cecelia Abadie was pulled over and given a speeding ticket while driving wearing Google Glass, an Android mixed-reality product. She was given an additional citation for wearing Google Glass. California vehicle code 27602 outlines that a person should not drive if a screen pointed toward the driver is displaying video. Both charges were thrown out because of lack of evidence that the device was turned on and playing video.\n\nBy February 2014, several states introduced legislation regulating the use of Google Glass behind the wheel. Google led lobbying efforts to kill bills banning Google Glass use while driving, arguing because the product was not yet readily available, banning it would be premature. Google Glass prototype sales ended in January 2015, but Google’s most recent enterprise version of the device was on the market from 2019 to 2023.\n\nIt’s unclear if Apple Vision Pro will face similar regulatory hurdles as the Google Glass but until it does, expect more inadvisable headset sightings in online stunts.\n\nThis story was originally featured on Fortune.com",
    "link":"https:\/\/finance.yahoo.com\/news\/people-wearing-apple-vision-pro-213849810.html",
    "symbols":[
      "0R2V.IL",
      "0RIH.IL",
      "AAPL.BA",
      "AAPL.MX",
      "AAPL.NEO",
      "AAPL.SN",
      "AAPL.US",
      "AAPL34.SA",
      "ABE0.F",
      "ABEA.F",
      "ABEA.XETRA",
      "ABEC.F",
      "ABEC.STU",
      "ABEC.XETRA",
      "APC.BE",
      "APC.DU",
      "APC.F",
      "APC.HA",
      "APC.HM",
      "APC.MU"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":-0.987,
      "neg":0.082,
      "neu":0.869,
      "pos":0.049
    }
  },
  {
    "date":"2024-02-05T21:20:34+00:00",
    "title":"Not All of Big Tech Posted Magnificent Results for the 4th Quarter",
    "content":"Did Meta and Amazon just save earnings season?\n\nBig tech earnings kicked off earnings season last week and not all of the results were so magnificent. Alphabet (NASDAQ:GOOGL) and Microsoft (NASDAQ:MSFT) got things started on Tuesday, and while both surpassed top and bottom-line expectations, it wasn't enough for investors. Weak advertising revenues for Alphabet resulted in a nearly 6% stock price decline in the wake of the report,[1] and light guidance from Microsoft also didn't go over well with investors.[2] Given the momentum tech had into these reports and rich price-earnings levels, investors were less willing to forgive minor stumbles. The same went for Apple (NASDAQ:AAPL), which reported disappointing revenue from China on Thursday, the stock fell over 5% in the hours after the report before climbing back on Friday.[3]\n\nWarning! GuruFocus has detected 6 Warning Signs with DIS.\n\nThe two standouts for last week were undoubtedly Meta (NASDAQ:META) and Amazon (AMZN?), both handily beating expectations on the top and bottom-line.[4] Even sweeter for Meta investors was the announcement of the company's first ever dividend of 50 cents as well as a $50 billion buyback plan.[5] CEO Mark Zuckerberg also vowed to \"keep things lean,\" a strategy that has worked well for the social media company who successfully pulled off the \"year of efficiency\" in 2023.[6]\n\nAs a result of better-than-expected reports last week, the FactSet blended S&P 500 EPS consensus now stands at 1.6%, an uptick from -1.4% the week prior.[7]\n\nBut that's not all that moved the markets last week, the first Federal Reserve meeting of 2024 ended up being a bust when Chairman Powell indicated they are not ready to begin cutting rates yet.[8] The CME Group FedWatch tool is now predicting a 60% probability of a rate cut at the May 1st meeting, with the likelihood of a March 20th cut falling to 21%.[9]\n\nWhile markets initially fell after that news on Wednesday, they perked back up after Thursday's tech results and Friday's blockbuster jobs number. Nonfarm Payrolls came in at 353,000 for January, and unemployment stayed at 3.7%, marking 24 consecutive months of sub-4% unemployment and the longest stretch since the 1960s.[10]\n\nStory continues\n\nIndustrials, pharma and consumer discretionary take center stage?\n\nWe get results from a smattering of sectors this week, including the restaurant space (MCD, CMG), Industrials (CAT, UBER), pharma (GILD, LLY) and always highly anticipated Disney (NYSE:DIS). Not All of Big Tech Posted Magnificent Results for the 4th Quarter\n\nSource: Wall Street Horizon\n\nOutlier earnings dates this week?\n\nAcademic research shows that when a company confirms a quarterly earnings date that is later than when they have historically reported, it's typically a sign that the company will share bad news on their upcoming call, while moving a release date earlier suggests the opposite.[11]\n\nThis week we get results from a number of large companies on major indexes that have pushed their fourth-quarter 2023 earnings dates outside of their historical norms. Nine companies within the S&P 500 confirmed outlier earnings dates for this week, all of which are later than usual and therefore have negative DateBreaks Factors*. Those names are McDonald's Corporation (NYSE:MCD), IDEX Corporation (NYSE:IEX), Edwards Lifesciences Corp (NYSE:EW), Mid-America Apartment Communities (NYSE:MAA), McKesson Corporation (NYSE:MCK), The Hershey Company (NYSE:HSY), ConocoPhillips (NYSE:COP), T. Rowe Price (NASDAQ:TROW) and Catalent Inc. (NYSE:CTLT).\n\n* Wall Street Horizon DateBreaks Factor: statistical measurement of how an earnings date (confirmed or revised) compares to the reporting company's 5-year trend for the same quarter. Negative means the earnings date is confirmed to be later than historical average while Positive is earlier.\n\nQ4 earnings wave?\n\nThis season peak weeks will fall between Jan. 29 - March 1, with each week expected to see over 1,000 reports. Currently Feb. 22 is predicted to be the most active day with 561 companies anticipated to report. Thus far, 64% of companies have confirmed their earnings date and 18% have reported (out of our universe of 10,000+ global names). Roughly 46% of the S&P 500 has reported. Not All of Big Tech Posted Magnificent Results for the 4th Quarter\n\nSource: Wall Street Horizon\n\n1 Alphabet Announces Fourth Quarter and Fiscal Year 2023 Results, January 30, 2024, https:\/\/abc.xyz2 Earnings Release FY24 Q2, Microsoft, January 30, 2024, https:\/\/www.microsoft.com3 Apple reports first quarter results, February 1, 2024, https:\/\/www.apple.com4 Amazon.com Announces Fourth Quarter Results, February 1, 2024, https:\/\/ir.aboutamazon.com5 Meta Reports Fourth Quarter and Full Year 2023 Results; Initiates Quarterly Dividend, February 1, 2024, https:\/\/s21.q4cdn.com6 Fourth Quarter 2023 Results Conference, Meta, February 1, 2024 Call, https:\/\/s21.q4cdn.com7 Earnings Insight, FactSet, John Butters, February 2, 2024, https:\/\/advantage.factset.com8 Federal Reserve issues FOMC statement, January 31, 2024, https:\/\/www.federalreserve.gov9 CME FedWatch Tool, CME Group, February 2, 2024, https:\/\/www.cmegroup.com10 Employment Situation Summary, U.S. Bureau of Labor Statistics, February 2, 2024, https:\/\/www.bls.gov11 Time Will Tell: Information in the Timing of Scheduled Earnings News, Journal of Financial and Quantitative Analysis, Eric C. So, Travis L. Johnson, Dec, 2018, https:\/\/papers.ssrn.com?\n\nCopyright 2024 Wall Street Horizon, Inc. All rights reserved. Do not copy, distribute, sell or modify this document without Wall Street Horizon's prior written consent. This information is provided for information purposes only. Neither TMX Group Limited nor any of its affiliated companies guarantees the completeness of the information contained in this publication, and we are not responsible for any errors or omissions in or your use of, or reliance on, the information. This publication is not intended to provide legal, accounting, tax, investment, financial or other advice and should not be relied upon for such advice. The information provided is not an invitation to purchase securities, including any listed on Toronto Stock Exchange and\/or TSX Venture Exchange. TMX Group and its affiliated companies do not endorse or recommend any securities referenced in this publication. TMX, the TMX design, TMX Group, Toronto Stock Exchange, TSX, and TSX Venture Exchange are the trademarks of TSX Inc. and are used under license. Wall Street Horizon is the trademark of Wall Street Horizon, Inc. All other trademarks used in this publication are the property of their respective owners.\n\nThis article first appeared on GuruFocus.",
    "link":"https:\/\/finance.yahoo.com\/news\/not-big-tech-posted-magnificent-212034350.html",
    "symbols":[
      "0RIH.IL",
      "AAPL.US",
      "ABE0.F",
      "ABEA.F",
      "ABEA.XETRA",
      "ABEC.F",
      "ABEC.STU",
      "ABEC.XETRA",
      "COP.US",
      "CTLT.US",
      "DIS.US",
      "EW.US",
      "FB20.F",
      "FB2A.F",
      "FB2A.HM",
      "FB2A.MU",
      "FB2A.XETRA",
      "GOGL34.SA",
      "GOGL35.SA",
      "GOOG.MX"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":0.955,
      "neg":0.045,
      "neu":0.893,
      "pos":0.062
    }
  },
  {
    "date":"2024-02-05T21:19:51+00:00",
    "title":"Spotify earnings preview: Investors eye margin improvements amid podcast pivots",
    "content":"Spotify (SPOT) is set to report its fiscal fourth quarter earnings on Tuesday before the bell as the music streaming platform continues to focus on profitability amid changes to its podcasting strategy.\n\nIn the third quarter, Spotify turned a profit for the first time in over a year as its recent price hikes coupled with lower-than-expected costs related to personnel and marketing spend boosted its bottom line.\n\nThe company also committed to lower podcast investments, which helped boost margins to 26% in the quarter. Spotify guided to more margin improvements in Q4 with the metric expected to come in at 26.6%.\n\nThe company has previously said it expects the metric to come in between 30% and 35% over the long term amid plans to further scale its podcasting and ads business. With the exception of Q3, margins have been stuck between 21% and 25% in recent quarters.\n\nOutside of margins, subscriber numbers are expected to once again surge with a gain of around 28 million monthly active users in the quarter, including 9 million premium subscribers, according to analysts.\n\nSpotify had guided to 27 million monthly active user additions but matched Wall Street's expectations of 9 million premium subs.\n\nHere's what Wall Street expects, according to Bloomberg consensus estimates:\n\nRevenue: 3.72 billion euros Adjusted loss per share: -0.31 euros Total monthly active users (MAUs): 602 million\n\nOverall, analysts have been bullish on Spotify after the audio giant pledged to improve its profitability beginning in 2023 on a gross margin and operating income basis.\n\nSpotify spent $1 billion pushing into the podcast market over the past four years with splashy A-list deals and $400 million-plus studio acquisitions.\n\nThat spending took a significant bite out of gross margins and weighed heavily on profitability. In response, Spotify committed to several rounds of layoffs — three in 2023 alone. The company also announced CFO Paul Vogel will step down from his position on March 31.\n\nStory continues\n\nIn addition to layoffs, Spotify raised prices, changed up its royalty structure, and made audiobooks free to paying subscribers.\n\nBut more changes are expected as Spotify further revamps its podcast strategy to focus more on distribution rather than exclusivity. Spotify is set to report its fiscal fourth quarter earnings on Tuesday before the bell as the music streaming platform continues to focus on profitability amid more changes to its podcasting strategy. (Patrick Semansky\/AP Photo, File) (ASSOCIATED PRESS)\n\nLate last week, Spotify announced a new deal with its most popular podcaster: Joe Rogan.\n\nThe company revealed Rogan's podcast, which was previously exclusive to Spotify, will be available on additional services like Apple Podcasts (AAPL), Amazon Music (AMZN), and YouTube (GOOGL) for the first time in years.\n\nThe multiyear deal, which the Wall Street Journal pegged at $250 million, represents Spotify's broader podcast distribution push, which it first began to roll out last year.\n\nUnder the new agreement, Spotify will handle distribution and ad sales as it works to maximize revenue. Rogan, meanwhile, will receive a guaranteed minimum rate and cut of the advertising revenue.\n\nThe company recently renegotiated a similar contract with \"Call Her Daddy\"'s Alexandra Cooper.\n\nThe podcast, which Spotify purchased for a reported $60 million in 2021, will now be available on all major audio platforms after more than two years as a Spotify exclusive. The company will maintain the exclusive rights to the podcast's video portion.\n\nSpotify shares have surged about 80% over the past year and are up more than 15% year to date. The stock is still off about 40% from its record high of $364.59 a share in February 2021.\n\nCorrection: A previous version of this article misstated Spotify's monthly active users growth. We regret the error.\n\nAlexandra Canal is a Senior Reporter at Yahoo Finance. Follow her on Twitter @allie_canal, LinkedIn, and email her at alexandra.canal@yahoofinance.com.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance",
    "link":"https:\/\/finance.yahoo.com\/news\/spotify-earnings-preview-investors-eye-margin-improvements-amid-podcast-pivots-211951651.html",
    "symbols":[
      "0R1O.IL",
      "0R2V.IL",
      "0RIH.IL",
      "0RIH.LSE",
      "639.F",
      "639.STU",
      "639.XETRA",
      "AAPL.BA",
      "AAPL.MX",
      "AAPL.NEO",
      "AAPL.SN",
      "AAPL.US",
      "AAPL34.SA",
      "ABE0.F",
      "ABEA.F",
      "ABEA.STU",
      "ABEA.XETRA",
      "ABEC.F",
      "ABEC.STU",
      "ABEC.XETRA"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":0.991,
      "neg":0.038,
      "neu":0.856,
      "pos":0.106
    }
  },
  {
    "date":"2024-02-05T20:49:00+00:00",
    "title":"Time to Buy Apple or Amazon Stock After Earnings?",
    "content":"Over the weekend investors were certainly digesting the quarterly results from Magnificent Seven players Amazon AMZN, Apple AAPL, and Meta Platforms META last Friday.\n\nOf course, Meta Platforms’ stood out by announcing its first-ever dividend during its earnings release but all three were able to exceed their top and bottom line expectations. While Meta may have stolen the show on Friday, let’s check out Amazon and Apple’s quarterly results and see if now is a good time to buy stock in these iconic tech giants.\n\nAmazon Q4 Review\n\nRounding out its fiscal 2023 Amazon reported Q4 earnings of $1.01 per share which easily surpassed the Zacks Consensus of $0.81 a share by 24%. Even better, Q4 earnings soared 380% from $0.21 a share in the comparative quarter. Fourth quarter sales of $169.96 billion beat estimates by 2% and leaped 14% YoY. Amazon produced Q4 net income of $10.6 billion which skyrocketed from the $300 million the e-commerce bohemoth brought in a year ago. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nAmazon attributed its very strong Q4 results to a record-breaking holiday shopping season and saw 13% and 17% growth in its North America and International segment sales respectively. In terms of its cloud services, Amazon’s AWS segment sales were up 13% to $24.2 billion during Q4 but slightly missed estimates of $24.37 billion.\n\nStill, Amazon’s total sales were up 12% in FY23 to $574.8 billion with net income of $30.4 billion climb swinging from a net loss of -$2.7 billion a year ago. This translated into annual earnings of $2.90 per share which skyrocketed 308% from $0.71 a share in 2022.  Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nApple Q1 Review\n\nReporting its fiscal first quarter results of Friday, Apple’s Q1 earnings of $2.18 per share was up 16% YoY to a new record high and topped the Zacks Consensus of $2.09 a share by 4%. Quarterly sales of $119.57 billion topped estimates by over 1% and rose 2% YoY. Apple reported net income of $33.92 billion which jumped 13% from the prior year quarter.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nApple’s Q1 growth was fueled by iPhone sales and an all-time revenue record in its Services segment sales which includes Apple news, music, and TV along with its App Store, iCloud, AppleCare, and Apple Pay. iPhone sales came in at $69.7 billion and beat estimates by 1% although Services sales of $23.11 billion were still -1% short of the consensus of $23.39 billion. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBottom Line\n\nFollowing their favorable quarterly results Amazon’s stock currently sports a Zacks Rank #2 (Buy) while Apple lands a Zacks Rank #3 (Hold). The trend of positive earnings estimate revisions looks likely to continue for Amazon while investors may want to monitor Apple’s warning of softer iPhone sales during the current quarter despite the company's immense probability.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
    "link":"https:\/\/finance.yahoo.com\/news\/time-buy-apple-amazon-stock-204900065.html",
    "symbols":[
      "0R2V.IL",
      "AAPL.BA",
      "AAPL.MX",
      "AAPL.NEO",
      "AAPL.SN",
      "AAPL.US",
      "AAPL34.SA",
      "AMZ.DU",
      "AMZ.F",
      "AMZ.HM",
      "AMZ.MU",
      "AMZ.STU",
      "AMZ.XETRA",
      "AMZ1.F",
      "AMZN.BA",
      "AMZN.MX",
      "AMZN.NEO",
      "AMZN.SN",
      "AMZN.US",
      "AMZO34.SA"
    ],
    "tags":[

    ],
    "sentiment":{
      "polarity":0.998,
      "neg":0.024,
      "neu":0.812,
      "pos":0.164
    }
  }
]